БухЭксп/InformationRegisters/CW_ОбъектыОграниченийДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбъектыОграниченийДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВладелецОбъектаДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВладелецОбъектаДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВладелецОбъектаДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗначениеБухгалтерияПредприятия</Name>
					<Comment>Бухгалтерия предприятия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеКоралВэй</Name>
					<Comment>Бухгалтерия экспедитора</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОбъектыОграниченийДоступа/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИдентификаторОбъектаМетаданныхПриИзменении(Элемент)
	
	Запись.ВладелецОбъекта  = ПолучитьВладельцаОбъекта(Запись.ИдентификаторОбъектаМетаданных);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВладельцаОбъекта(ИдентификаторОбъектаМетаданных)
	
	Если СтрНачинаетсяС(ИдентификаторОбъектаМетаданных.Имя , "CW_") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеКоралВэй");
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеБухгалтерияПредприятия");
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_CW_ОбъектыОграниченийДоступа");
	
КонецПроцедуры
